Hello! I have tested today and I can confirm that `cost_center` value is being updated without errors.

But provider also updates inner vlans every time, which is not desired. Confirmed this in a Staging portal after apply.

```
 terraform apply -var-file test-config.tfvars
data.aws_secretsmanager_secret.megaport: Reading...
data.aws_secretsmanager_secret.megaport: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:893677514652:secret:megaport-dev-EMVzzv]
data.aws_secretsmanager_secret_version.megaport: Reading...
data.aws_secretsmanager_secret_version.megaport: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:893677514652:secret:megaport-dev-EMVzzv|AWSCURRENT]
data.megaport_location.default: Reading...
data.megaport_location.aws[0]: Reading...
data.megaport_location.aws[0]: Read complete after 4s [name=Interxion PAR5]
data.megaport_location.default: Read complete after 4s [name=Equinix PA2/3]
megaport_port.ipxgrx: Refreshing state...
data.megaport_partner.internet: Reading...
data.megaport_partner.aws_port: Reading...
megaport_mve.fortigate: Refreshing state...
megaport_vxc.ipxgrx[0]: Refreshing state...
data.megaport_partner.internet: Read complete after 1s
megaport_vxc.internet: Refreshing state...
data.megaport_partner.aws_port: Read complete after 2s
megaport_vxc.aws[0]: Refreshing state...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # megaport_mve.fortigate will be updated in-place
  ~ resource "megaport_mve" "fortigate" {
      ~ contract_start_date    = "Wednesday, 26-Jun-24 12:13:27 EEST" -> (known after apply)
      ~ cost_centre            = "A-???-2024-GER-???-123" -> "A-123-2024-GER-123-123"
      ~ last_updated           = "Wednesday, 26-Jun-24 12:16:13 EEST" -> (known after apply)
      ~ live_date              = "Wednesday, 26-Jun-24 12:13:27 EEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ resources              = {
          + interface       = (known after apply)
          ~ virtual_machine = [
              - {
                  - cpu_count     = 4 -> null
                  - id            = 0 -> null
                  - image         = {
                      - id      = 58 -> null
                      - product = "FortiGate-VM" -> null
                      - vendor  = "Fortinet" -> null
                      - version = "7.4.3" -> null
                    } -> null
                  - resource_type = "virtual_machine" -> null
                  - up            = true -> null
                  - vnics         = [
                      - {
                          - description = "mgmt" -> null
                          - vlan        = 3905 -> null
                        },
                      - {
                          - description = "to_ipxgrx" -> null
                          - vlan        = 2730 -> null
                        },
                      - {
                          - description = "to_aws" -> null
                          - vlan        = 599 -> null
                        },
                    ] -> null
                },
            ] -> (known after apply)
        } -> (known after apply)
        # (27 unchanged attributes hidden)
    }

  # megaport_port.ipxgrx will be updated in-place
  ~ resource "megaport_port" "ipxgrx" {
      ~ attribute_tags         = {
          ~ terminated_service_details = {
              ~ device    = "" -> (known after apply)
              ~ interface = {
                  ~ demarcation   = "" -> (known after apply)
                  ~ loa_template  = "" -> (known after apply)
                  ~ media         = "" -> (known after apply)
                  ~ port_speed    = 0 -> (known after apply)
                  ~ resource_name = "" -> (known after apply)
                  ~ resource_type = "" -> (known after apply)
                  ~ shutdown      = false -> (known after apply)
                  ~ up            = 0 -> (known after apply)
                } -> (known after apply)
              ~ location  = {
                  ~ id        = 0 -> (known after apply)
                  ~ name      = "" -> (known after apply)
                  ~ site_code = "" -> (known after apply)
                } -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      ~ cancelable             = true -> (known after apply)
      ~ contract_end_date      = "Wednesday, 25-Jun-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date    = "Wednesday, 26-Jun-24 12:13:27 EEST" -> (known after apply)
      ~ cost_centre            = "A-???-2024-GER-???-123" -> "A-123-2024-GER-123-123"
      ~ create_date            = "Wednesday, 26-Jun-24 12:12:30 EEST" -> (known after apply)
      ~ last_updated           = "Wednesday, 26-Jun-24 12:16:13 EEST" -> (known after apply)
      ~ live_date              = "Wednesday, 26-Jun-24 12:13:27 EEST" -> (known after apply)
      ~ locked                 = false -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ resources              = {
          ~ interface = {
              ~ demarcation   = <<-EOT
                    Equinix PA2/3
                    114 Rue Ambroise Croizat, Saint Denis
                    0210
                    Type: Single-mode Fibre Pair
                    Ports: PP:0210:1177142, ports 7+8
                    Termination: SC connector
                EOT -> (known after apply)
              ~ description   = "" -> (known after apply)
              ~ id            = 0 -> (known after apply)
              ~ loa_template  = "megaport" -> (known after apply)
              ~ media         = "LR" -> (known after apply)
              ~ name          = "" -> (known after apply)
              ~ port_speed    = 10000 -> (known after apply)
              ~ resource_name = "interface" -> (known after apply)
              ~ resource_type = "interface" -> (known after apply)
              ~ up            = 1 -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      + terminate_date         = (known after apply)
      ~ usage_algorithm        = "NOT_POST_PAID" -> (known after apply)
      ~ virtual                = false -> (known after apply)
      ~ vxc_auto_approval      = false -> (known after apply)
      ~ vxc_permitted          = true -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # megaport_vxc.aws[0] will be updated in-place
  ~ resource "megaport_vxc" "aws" {
      ~ a_end                = {
          ~ current_product_uid   = "42f8f153-8acc-498c-b1d3-6577f93dd97f" -> (known after apply)
          ~ inner_vlan            = 1620 -> (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "LBO-EU-Paris-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "09e400a0-1b72-49ec-8ff0-5a71a4fc7774" -> (known after apply)
          ~ inner_vlan            = 0 -> (known after apply)
          ~ location              = "Interxion PAR5" -> (known after apply)
          ~ location_id           = 527 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "605cb850-dfb4-4a05-a171-8bf17757b3a2" -> (known after apply)
          ~ product_name          = "EU (Paris) (eu-west-3)" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ b_end_partner_config = {
          + partner_a_end_config = (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Thursday, 25-Jul-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Wednesday, 26-Jun-24 12:14:07 EEST" -> (known after apply)
      ~ cost_centre          = "A-???-2024-GER-???-123" -> "A-123-2024-GER-123-123"
      ~ create_date          = "Wednesday, 26-Jun-24 12:13:08 EEST" -> (known after apply)
      ~ csp_connections      = [
          - {
              - bandwidth     = 100 -> null
              - bandwidths    = [
                  - 100,
                ] -> null
              - connect_type  = "AWSHC" -> null
              - connection_id = "" -> null
              - name          = "LBO-EU-Paris-ICSS-AWS" -> null
              - owner_account = "893677514652" -> null
              - resource_name = "b_csp_connection" -> null
              - resource_type = "csp_connection" -> null
            },
        ] -> (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Wednesday, 26-Jun-24 12:16:47 EEST" -> (known after apply)
      ~ live_date            = "Wednesday, 26-Jun-24 12:14:07 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_SPEED_METRO_VXC" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 599 -> (known after apply)
          ~ b_vlan          = 599 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # megaport_vxc.internet will be updated in-place
  ~ resource "megaport_vxc" "internet" {
      ~ a_end                = {
          ~ current_product_uid   = "42f8f153-8acc-498c-b1d3-6577f93dd97f" -> (known after apply)
          ~ inner_vlan            = 3090 -> (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "LBO-EU-Paris-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "52cb6573-5cc8-45cc-8af1-d21db1fe3485" -> (known after apply)
          ~ inner_vlan            = 0 -> (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "2f83dc65-5d4c-4730-a66d-926db48a0326" -> (known after apply)
          ~ product_name          = "Megaport Internet" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Wednesday, 25-Jun-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Wednesday, 26-Jun-24 12:14:07 EEST" -> (known after apply)
      ~ cost_centre          = "A-???-2024-GER-???-123" -> "A-123-2024-GER-123-123"
      ~ create_date          = "Wednesday, 26-Jun-24 12:13:06 EEST" -> (known after apply)
      ~ csp_connections      = [
          - {
              - connect_type         = "TRANSIT" -> null
              - customer_ip4_address = "162.43.161.29/31" -> null
              - customer_ip6_network = "2a0a:1800:1c:e::/64" -> null
              - ipv4_gateway_address = "162.43.161.28" -> null
              - ipv6_gateway_address = "2a0a:1800:1c:e::1" -> null
              - resource_name        = "b_csp_connection" -> null
              - resource_type        = "csp_connection" -> null
            },
        ] -> (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Wednesday, 26-Jun-24 12:16:45 EEST" -> (known after apply)
      ~ live_date            = "Wednesday, 26-Jun-24 12:14:07 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_NORMALISED_SPEED" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 3905 -> (known after apply)
          ~ b_vlan          = 3905 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # megaport_vxc.ipxgrx[0] will be updated in-place
  ~ resource "megaport_vxc" "ipxgrx" {
      ~ a_end                = {
          ~ current_product_uid   = "42f8f153-8acc-498c-b1d3-6577f93dd97f" -> (known after apply)
          ~ inner_vlan            = 498 -> (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "LBO-EU-Paris-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "32ec2948-7f34-4ebd-b052-97c9d0bc5cf6" -> (known after apply)
          ~ inner_vlan            = 0 -> (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "LBO-EU-Paris-ICSS-Port" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Thursday, 25-Jul-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Wednesday, 26-Jun-24 12:14:07 EEST" -> (known after apply)
      ~ cost_centre          = "A-???-2024-GER-???-123" -> "A-123-2024-GER-123-123"
      ~ create_date          = "Wednesday, 26-Jun-24 12:13:06 EEST" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Wednesday, 26-Jun-24 12:16:46 EEST" -> (known after apply)
      ~ live_date            = "Wednesday, 26-Jun-24 12:14:07 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_SPEED_METRO_VXC" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 2730 -> (known after apply)
          ~ b_vlan          = 2730 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "tags" but a value was found in file "test-config.tfvars". If you meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

megaport_port.ipxgrx: Modifying...
megaport_mve.fortigate: Modifying...
megaport_port.ipxgrx: Still modifying... [10s elapsed]
megaport_mve.fortigate: Still modifying... [10s elapsed]
megaport_port.ipxgrx: Still modifying... [20s elapsed]
megaport_mve.fortigate: Still modifying... [20s elapsed]
megaport_port.ipxgrx: Still modifying... [30s elapsed]
megaport_mve.fortigate: Still modifying... [30s elapsed]
megaport_port.ipxgrx: Modifications complete after 33s
megaport_mve.fortigate: Modifications complete after 33s
megaport_vxc.ipxgrx[0]: Modifying...
megaport_vxc.internet: Modifying...
megaport_vxc.aws[0]: Modifying...
megaport_vxc.ipxgrx[0]: Still modifying... [10s elapsed]
megaport_vxc.internet: Still modifying... [10s elapsed]
megaport_vxc.aws[0]: Still modifying... [10s elapsed]
megaport_vxc.aws[0]: Still modifying... [20s elapsed]
megaport_vxc.internet: Still modifying... [20s elapsed]
megaport_vxc.ipxgrx[0]: Still modifying... [20s elapsed]
megaport_vxc.ipxgrx[0]: Still modifying... [30s elapsed]
megaport_vxc.aws[0]: Still modifying... [30s elapsed]
megaport_vxc.internet: Still modifying... [30s elapsed]
megaport_vxc.internet: Modifications complete after 33s
megaport_vxc.ipxgrx[0]: Modifications complete after 33s
megaport_vxc.aws[0]: Modifications complete after 34s

Apply complete! Resources: 0 added, 5 changed, 0 destroyed.
```
